[
  { "title": "Clearing Cache in vProMedia", "url": "https://vcreativeinc.com/knowledge/clearing-cache-in-vpromedia", "content": "A cache -- pronounced CASH -- is hardware or software that is used to store something, usually data, temporarily in a computing environment. Clearing your browser's cache and temporary internet files regularly helps your computer or device run optimally—and doing so can help fix certain problems, like a website loading slowly, or formatting issues on a web page. Once every couple of weeks is helpful for regular maintenance. If you are asked to clear your cache in the vProMedia product, here is the process to follow. In your vProMedia account, right click your mouse (outside of the order area) and click Inspect. That will open the development tools. In the development tools bar look for Application and click it. Then look for Storage and click it. Under Storage you should see how much usage vcreative.net is taking up, on Chrome it looks like the below...click Clear Site Data...that will clear the data and log you out of your session. If you have further questions on clearing cache in vProMedia, please contact our Help Desk team at 1-800-605-9889 or email at support@vcreativeinc.com." },
  { "title": "Bulk Actions", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360056077853-bulk-actions", "content": "Users may have the need to change the same information about multiple requests at one time. These 'Bulk Actions' are typically reserved for department managers. Users who do have access to altering multiple fields on requests will see 'Bulk Actions' in their Action Bar when they have selected multiple requests. Selecting only one request will show 'Bulk Actions' greyed out. Like many of the higher level and restricted actions, doing Bulk Actions is mostly reserved for managers. It will also only allow for bulk changes to the selected requests if those changes are valid across all requests. The current options for Bulk Actions are: Status, POC Assignment (and removal), Job Completions, File Uploads, Production Notes, Voice Requests, Date Changes. If any one of the requests can not have a specific status applied to it, that will not be an option. The same games for the POCs and Job Completions." },
  { "title": "Reject Request", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360056073553-reject-request", "content": "Using the Reject option on the Action Bar will allow a manager to send a request or multiple requests back to their submitter. The Reject option will only show up if the active user is a manager, but other accounts can be set up to have this option if needed, just reach out to the vCreative Help Desk with your request. Clicking Reject will take the selected request(s) into the familiar right-hand panel for the next step. If multiple requests are selected they will all be shown, and same-client requests will be grouped. To reject a request, it will require a quick blog post. Click the right arrow to reject that specific request. Each request being rejected will require input/feedback. The blog you post should be specific to why the submitted request is being sent back. The 'Post & Reject' button will save and post your Blog and return the request as a Draft to the user who submitted it. That user will then need to address the rejection's cause and resubmit." },
  { "title": "Request Selection", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360054283814-request-selection", "content": "If you run a search or visit a folder, you have the option to select the rows of specific requests that you need to do something with. On the far left of any List View, you will find a column of checkboxes. Each box you check will highlight that request. You may also bulk-select every request in view with the checkbox at the very top. When you have any number of requests selected, the Action Bar will show up at the bottom of your screen. The options you see in the Action Bar depend on the requests you have selected and what type of user you are. You can quickly de-select using the orange 'X' at the left-most of the Action Bar. You can also click the 'View' link to focus your view on only the selected requests." },
  { "title": "Action Bar", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360054284414-action-bar", "content": "If you have already selected some requests, you will see the Action Bar at the bottom of your screen. The action bar will offer actions based on your account, role, and what requests you have selected. You can quickly de-select using the orange 'X' at the left-most of the Action Bar. You can also click the 'View' link to focus your view on only the selected requests. For more information on each of the actions, click the option below: Export, View, Reject, Copy, Extend, Revise, Bulk Actions." },
  { "title": "You can use the search tool to find any order in vPro. And you can even use it to create your own folders.", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5673736389019-you-can-use-the-search-tool-to-find-any-order-in-vpro-and-you-can-even-use-it-to-create-your-own-folders-", "content": "Once the production for a request is complete and a spot archives, that doesn’t mean that it’s gone from vPro. You can find any archived requests, plus what’s currently in production by using the Search tool. A useful or frequently used search can also be saved to become a custom folder view." },
  { "title": "Orders can be rejected after submission. Here are more details on that process.", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5670360640667-orders-can-be-rejected-after-submission-here-are-more-details-on-that-process-", "content": "In vPro, once an order is submitted, it may be rejected based on incomplete work or an error in the request form. Manager have the option to reject that order. Here is the rejection process." },
  { "title": "What are all the options you see on the left side of your account page? Here are your navigation tips.", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5669989151515-what-are-all-the-options-you-see-on-the-left-side-of-your-account-page-here-are-your-navigation-tips-", "content": "In vPro, the options you have to choose from on your left sidebar are dependent on your role and abilities. Here is a reference on what those options are and how to navigate them." },
  { "title": "Consider saving time by using your drafts as templates!", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5670999567643-consider-saving-time-by-using-your-drafts-as-templates-", "content": "Drafts in vPro will be created when you click the +New Request button. They will save everything you do in an order and the draft will remain in your drafts folder until you delete it. So this makes a great tool to create templates for frequently used requests." },
  { "title": "Enhanced Search Experience", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360051286653-search", "content": "With this latest enhancement, initiating a search from within a custom folder becomes more intuitive and tailored to your needs. When you start a search within a custom folder, the results will exclusively reflect requests from within the current search folder's parameters. Users will now encounter a prompt offering the choice to search within the current folder or across All folders. This empowers users to optimize their search experience based on their specific requirements, ensuring they find precisely what they're looking for with ease. You can now save your searches quicker too! We've moved the Save Search as Folder button up to the Search Results table. So you no longer have to click back into the magnifying glass to save your results to a new custom folder." },
  { "title": "Rejected Requests", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360056074613-rejected-requests", "content": "Sometimes a request that is submitted will be sent back. This could be due to incomplete information or user errors while filling out the Quick Order. No matter the reason, a manager has the ability to Reject a request so it can be re-addressed, improved, or otherwise fixed before moving forward in the workflow. When something submitted gets rejected, a Task notification will show up for the user who submitted it. After the request is re-submitted the Task notification will auto-hide to keep things clean in the Task tray. Rejected request quickly linked in its Draft state from the notification. Rejected requests can be fixed/re-submitted by clicking on the client name." },
  { "title": "File Type Edits During Order Entry", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/1260803723189-file-type-edits-during-order-entry", "content": "If you’ve chosen the wrong File Type, you can now edit on the Quick Order/Request Form before submitting the request! If the wrong File Type was selected click on the Edit icon to the right of the file to make changes." },
  { "title": "Order Entry", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360050535714-order-entry", "content": "Your unique request forms will be customized to the fields and responses your managers dictate. The form will provide the requirements and options needed to process your request. You will notice highlighting of required fields that have not yet been submitted. Your request form will automatically save as a draft until submitted. A running draft is saved continuously as you supply info, starting with Client Name. You will find all un-submitted orders in the Drafts folder. A multi-line or multi-spot request can be done easily by using the ADD REQUEST on the right column of the request form. You can't submit until all required fields are provided." },
  { "title": "List View", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360051289293-list-view", "content": "Available view options are shown for all users in the 'Cog' options. No matter your role, each request your account is connected to is listed by default in the 'List' style of view. This view is arranged in columns that are each sort-able with a click of the mouse. From left to right represents one production request. The columns may vary depending on your usage and industry. Users can easily see the basic information for any request in this view, as well as change the status, set a cart number, and mark as scheduled and dubbed. Changes made in this view are instant for the user and other users who are connected to the request. The number of requests listed at one time is an option you can set at the bottom of the page. An alternate Calendar view or Compact view is possible as well." },
  { "title": "Compact View", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/4415551604123-compact-view", "content": "Along with the list view and calendar view, you now have the option to work in Compact view! This is the preferred view for TV Promotions teams. We understand that it is common to have large orders with several layers that you may not need to see all at once. To set your account to Compact view, click on the Settings icon to the right of the Resource Calendar at the top right of your screen. The Compact view allows you to see just the basic information of a request. Then, clicking on the request will open up the details to see all of the actionable items that you are used to seeing in the list view. When the details of a request are expanded you can: assign jobs, complete jobs, see the special instructions, view any notes or scripts, view run dates and contract details, any files that are attached or add new ones, request a voice part, check for approvals needed and book resources and equipment." },
  { "title": "Calendar View", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360050538374-calendar-view", "content": "The vPro Calendar view enables users to do more while having a 30,000 foot view of your production workload. If the calendar view is enabled in your firm settings, you will be able to switch viewing modes from the Settings icon at the top right of your account. You can select if you want to stay in the List view or change any of your folders/filters to Calendar View to see quickly what requests are due to be completed or which requests are scheduled to start. You can sort by the due date or run dates and Month view or Week view. This selection of view is saved per-folder. All details of a request can be displayed from the calendar by clicking on a request and then Show Details. From the details of the calendar view you can process approvals, add files, update scripts and more! Contact vCreative Support for any questions about Calendar View functionality." },
  { "title": "What is the Script Timer?", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/115002004714-what-is-the-script-timer-", "content": "The script timer calculates audio recording lengths to determine how long it will take to read a script. When calculating the read time, the following criteria is considered: numbers, the dollar sign, and the percentage sign are converted to words; all text inside ( ) and [ ] are ignored. The adjusted word-per-minute (wpm) factors in the length of each word. For instance, 'I run' counts as one word, however 'rhinoceros' counts as two words. For example, this script's read rate calculation is based on this script content: SPONSORED BY LOWE'S. STOP INTO LOWE'S SPRING BLACK FRIDAY EVENT FOR VALSPAR PAINT AND PRIMER STARTING AT A NEW LOWER PRICE OF NINETEEN NINETY-EIGHT. OFFER VALID THROUGH MAY FIRST. U.S. ONLY. SEE STORE FOR DETAILS. Words: 35 Characters: 213 Estimated Length is 9.5 seconds. Whether using the Script box in a quick order or using the Script timer in your system folders. 1. Type or copy/paste your script into the text box provided. 2. As you type, the number of seconds/minutes it should take to read appears to the left. The default Script Read Speed in vPPO is 222.0 (adjusted wpm). If you need assistance adjusting this setting, please call or live chat our help desk." },
  { "title": "How do I delete my drafts?", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5516379656731-how-do-i-delete-my-drafts-", "content": "If an order that is saved in the Drafts folder is no longer needed, it can be removed by setting the status to 'Deleted'. Users can also select more than one draft to set multiple statuses to deleted to remove ALL of those requests at once. If an order has already been submitted, meaning traffic and production departments can now see it, a Revision is usually the best way to proceed. This way everyone can be certain that the entire staff knows the request is being halted and didn't advance through the workflow. In case they need to be found at a later date, deleted requests are still visible using the search feature. However, deleted DRAFTS are not searchable." },
  { "title": "How can I save a search?", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5516841629851-how-can-i-save-a-search-", "content": "Once the production for a request is complete and a spot archives, that doesn’t mean that it’s gone from vPro. You can find any archived requests, plus what’s currently in production by using the Search tool. Clicking the Search button in the upper right of any List View will expand your search options. You can also find the search at the bottom right of the page once you begin to scroll away from the top of the page. For best results, begin your search while in the All or Inbox folders. You can select as many search criteria as necessary. Also keep in mind that Search remembers your last query when running search-after-search. You can use the 'Clear' button at the bottom of the Search tool to clear all search fields." },
  { "title": "How can I find out when something was done on a request?", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5516048631835-how-can-i-find-out-when-something-was-done-on-a-request-", "content": "Every request tracks a HISTORY - a record of each update and edit from the moment of creation. This allows users to look through and see who did what and when. Access a request history by using the icon in the PO column. Any changes will have a stricken out version along with what it’s replacing. There are two views available in the history sidebar. You can choose between simple view and full view. Request history also includes a search tool to narrow down what is listed within the current request. You can search by typing in names, dates, and even text from scripts or blog entries. Your recent user history is also available. It can be found in the user account menu on the top right of the screen. If an order leaves your view due to a status change or filtering options, you can quickly recall the most recent activity in your account. Users also have the ability to set a date range or search by user activity to narrow down the history that is being viewed." },
  { "title": "Pre-Loaded Client File Attachment on List View", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/1260803722789-pre-loaded-client-file-attachment-on-list-view", "content": "If you have saved frequently used files to a client, those files are accessible from the order form view, the File Details sidebar, and now from the files drag & drop box. When you select Browse in the drag & drop box, you will see the newly added option to attach any preloaded files that are stored for an advertiser. Once Preloaded Files are selected, you’ll see a list of any current files already attached to the request and have a drop-down to choose from any preloaded files available. Selecting one or all of the files will attach them to the surface level of the order for use in the making of the request. Users can load the client-specific files from the Settings > Clients page. Attach pre-loaded Client Files from the List view. Users can load the client-specific files from the Settings > Clients page." },
  { "title": "Option to Export", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/4415563032987-option-to-export", "content": "If there is a need to send the order to a 3rd party vendor or for billing purposes, you can select the orders you wish to share and choose the export option in the action bar. Once you choose to export, you can decide what information from the request needs to be shared. Then, choose the format you’d like to receive. Options currently available are Excel and Pdf. Whether you need a recap report for each request or need to send to a third party vendor for fulfillment, exporting is made simple in vPro." },
  { "title": "A Fresh New Look Is Coming To Your Order Forms!", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/7658764092187-a-fresh-new-look-is-coming-to-your-order-forms-", "content": "Expected release date: Week of 8/15/2022. Please reach out with any questions, concerns or to schedule a one-on-one training session. Aaron Mohr - Implementation Specialist, vPro aaron@vcreativeinc.com. Cyndi Bass - Product Manager, vPro cyndi@vcreativeinc.com." },
  { "title": "Lead Time By Ad Type", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/5448120146331-lead-time-by-ad-type", "content": "Submitting a new request always requires a due date. However, the level of work being asked for in the request could better inform the due date. Make sure that simple work can be 'due tomorrow' while more complex requests adhere to defined rules by the production department. Your order forms can now have set lead times based on the Due Date entered to ensure enough time between production and ready for air. Customer Support or Users with Local Admin access can set the lead time per Ad Type or project from the Local Admin>vPro Ad types tab>Ad type options>Lead Time. The number of days set will determine the first start date available based on the due date set. For instance, setting 3 days will ensure that there are 3 business days between the Due date selected on the form and the first available start date. US holidays and weekends are not included." },
  { "title": "Managerial Abilities", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360052453393-managerial-abilities", "content": "If you are a manager of any type at your location, you'll have higher permissions and more abilities in vPro. The following are dependant on what role you fulfill, but our roles are very customizable should your job require one of these options and you don't currently have it. Just reach out to our Help Desk! Delegating: The various jobs required to complete a request as assigned to a filtered to only staff whose own accounts are enabled to do that task. Someone who is only a Writer can be assigned to handle Traffic or Scheduling, for example. The POC column will show you a drop-down menu for any job your account has the authority to delegate. You can also delegate through the Context Menu. Unassign as easily as you assign each job. Voice Assignments: The 'Add Voice' link in the Files Column will show up if your account has the authority to send out voice-only requests. Editing: As a manager, you sometimes have to 'fix' someone else's errors. While you can click on the client name to open a request back up in the Quick Order view, some fields will be open for you to edit directly from the List View. Approvals: Typically it is the AE, or through them the Advertiser, that will give approvals on work. However, managers do have the option to Approve or Deny these reviews should they be aware of its outcome. Client Management: When being set up for vPro use, a provided Client List can be imported as a starting point to keep the list of clients clean and accurate. Manual management is also an option for most managers." },
  { "title": "Tasks and Notifications", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360052646573-tasks-and-notifications", "content": "If your account is set up where you are someone who can be assigned as a POC (Sales, Production, Writing, etc.) the Task notifications tell you when your attention, talent, or services are needed. Each task or job assigned to you may generate a notification that can be clicked on to navigate to the request you are now a POC on. For any workflow event that you've enabled an in-system notification for, you will receive that notice in real-time as it occurs. Just like tasks, you can click on the notification event to instantly navigate to a focused view or 'Quick Filter' on the relevant request(s). Tasks and Notification can stack up. At any time you have the ability to clear them out individually or in bulk to stay on top of relevant information. Every Task and Notification also has a Read and Unread state, much like emails. This helps you stay on top of which you have previously clicked on (Read) or which you've yet to investigate (Unread). All unread notifications show up in bold, while the ones you've already clicked on have faded text. You'll also find an 'x' icon to the right for clearing individual notifications out if they've already been read/clicked on. You'll also find sorting and Bulk Action menus at the top for Tasks and Notifications. Every user will get Task and Notification reminders when specific events occur. Most of these events can be set in your user settings for getting emails or in-system notifications about. Managers may also opt to lock certain settings to prevent anyone from being out of the loop. Simply click the 'Clipboard' or 'Mail' icons in the upper-right to open the Task and Notification panel. A live count of the unread Tasks and Notifications can be found in the top right of your screen." },
  { "title": "vPRO Implementation & Training", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360059975453-vpro-implementation-training", "content": "vPro Market Implementation Guide. Contact Information: vCreative Support Main Number: 800-605-9889 or support@vcreativeinc.com. Unlimited technical support is included in the monthly licensing fee. Roll out procedures: Normal Implementation is 2–3 weeks for setup and training phase, but can be as little as a few days. The learning curve is short for most users and stations are typically up and running quickly. Implementation: In order to provide a smooth implementation of vPro, consistent coordination and communication between the two companies is vital. All training is done remotely via GoToMeeting webinars. Phase 1: The Product Manager will oversee your vPro roll out. 1 or 2 employees from your market appointed as your point-of-contacts. Market/Station information is gathered and each station is set up into vCreative. A follow up meeting to make sure that all is correct, and to go over market workflow and schedule training sessions. Your market point-of-contact(s) will determine a Go Live Date. Phase 2: Once firm setup is complete, all employees will be given instructions to sign up for a vPro User Account. Your vCreative Point-of contact will conduct online live training webinars for Production, Traffic, Digital and all Producers, and a separate training for Sales. Phase 3: An all staff follow up Q&A session is recommended within 2 weeks of initial training/Going Live. Your vCreative point-of-contact will reach out to get this scheduled. IT REQUIREMENTS: vPro is web-based and works with all common, up-to-date browsers. We recommend Chrome, Firefox, MS Edge or Safari as the best browsers. We do not support Internet Explorer. Bookmarks/Shortcuts: When setting up bookmarks and shortcuts, the best practice is to use the following login page as a direct link. Clients should use vcreative.net for product signup and use. Email: To be sure that your staff is receiving the email notifications that they should, vCreative’s IP addresses should be white-listed on your spam blockers. JavaScript/ActiveX: JavaScript must be enabled for the use of vPPO. Firm Setup & Training Begin: vCreative will send an intro email with setup link and instructions. Establish training timeline. Add Stations, File Types, Ad Types, Media Services, Update Firm CRM, Upload Client Logo, Replicate any provided forms. CALL with Production Director, DOS, GM to go over Firm Setup, Workflow Logic and Customizations. Any Customizations/Changes needed will be confirmed in a follow-up call. Once trainings are scheduled the signup link will be shared for users to begin creating their accounts. User Signup Report will be shared with markets. Training begins. Updates and Bug Fix Releases: vCreative has an active update schedule with new features being implemented regularly. Users can submit new feature requests and bug reports directly from user options within your account. Software updates are pushed live during off-hours to prevent interruptions. The following is an itinerary for each training session by department: Sales Training, Production Training, Talent / Job POC Training, Traffic Training, DIGITAL TRAINING. Once all trainings have been completed and GoLive Date is established: vC Sales Person will be notified. Establish a date for 7 day Followup Review & Q&A. Hold 7 Day Followup Q&A. Voice Pool /Integrations Discussions continue. Voice Pool Setup (if interested). 30 Day Followup. 60 Day Followup. 90 Day Followup. vCreative will conduct quarterly check-ins to the market point of contact to ensure they are utilizing the product to its fullest potential and offer any recommendations for better usage, offer support through additional training and advise of any updated features or functionality." },
  { "title": "Voice Requests", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360056305914-voice-requests", "content": "Asking for voice work on a production request is started through the 'Add Voice' link found in the Files column. Typically, only producers or Production Managers have access to this option but exceptions can be made when needed. Groups of voice talent are most often set up as 'Voice Pools' during the roll-out and training period. New groups and pools can be established with assistance from the vC support team. Each voice request can be one of three types: Direct, All Swim, Audition. Starting a voice request will ask for basic information, such as when the talent should have their parts completed and what part of the script they are reading. Voice requests can be done directly, as an assignment, or as more open requests. The 'Search Type' defaults to 'Talent' which allows you to select the specific talent you wish to voice a part of the script. You can filter based on many voice qualities and properties. You even have the option to play the talent's sample audio to make sure they're the best fit. Once you found the right voice, simply check them off and click 'Select Talent'. The 'All Swim' request allows you to pick as many or as few filters to limit the talent. All matching talent will be notified and they'll need to 'Grab' the request which makes sure no other talent starts it as well, causing duplicate work. The audition is put out to a voice pool just like the All Swim, however, it allows for multiple talents to upload their voices in hopes of landing the part. This option is mostly used when producers or the advertisers are needing to be extra particular about getting just the right voice and would like to hear staff 'try out'." },
  { "title": "vPro Options", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360050538214-vpro-options", "content": "From the vPro tab in your Account Settings you can set and adjust your site preferences. Contact Options: Set your contact information to display as a preset signature line when using the Send Email function to share proofs with your clients for approvals. Site Options: PO OPTIONS: Turn on/off Pop up calendar to either select dates from a calendar or enter dates into date fields manually. Use a 3 month calendar view to display 3 months at a time instead of toggling through one month at a time. Have your calendar start the week on a Monday using a broadcast calendar. Display requests in order by Start Date rather than by Due Date. Collapse your list view to see only a few main details of an order until you are actively processing the request. Collapse special instructions to free up screen space if there is an extensive amount of question on an order form. Hide scheduled spots in list views if you have traffic duties and do not wish to see orders once they've been scheduled. Hide uploaded spots in list views if you have digital duties and do not wish to see orders once they've been uploaded to the digital platform. Show out cue popup in list view to skim the audio of a file attached. Hide dubbed spots in list views if you have production duties and do not wish to see orders once they've been dubbed into the automation system. Hide delegated orders that are in the Needs Dubbing status from your Inbox view. Separate producers by market if you are linked to other markets and wish to group producers together by their location. Show reminder for orders that have gone Past Due that are in the Extended Dates, Needs Dubbing or Specs in Spot Review status. STARTS SOON DAYS (Traffic/Production Directors): Adjusting the number of days will determine how far out before a start date that you will see the orders in this folder. DAYS TILL SPOTS EXPIRE: Adjusting the number of days will determine how far out before the end date that you will see orders in this folder. SELECT FILE OPTIONS: Show original file name will invert how you see files labeled when attached in the files column. Show any comments that were left by a user when attaching a file. Show the upload person and timestamp of a file added. SELECT VOICE REQUESTS: Hide voiced talent requests if you no longer wish to see them once completed. Hide requests that have been auditioned by multiple people and a voice was chosen. ON SUBMIT GO TO: Submitted Order - will show you the order you've just submitted. All - will take you to your All folder. Drafts - will take you to orders that have not yet been submitted. Inbox - will take you to all orders still pending Scheduling and/or Production." },
  { "title": "User Recent History", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/4415544441371-user-recent-history", "content": "Recent History is now available from the user account menu. If an order leaves your view due to a status change or filtering options, you can quickly recall the most recent activity in your account. Recent history can be found in the top right of your account in the drop-down menu under your name." },
  { "title": "Browser and Desktop Notifications", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/1260803316770-browser-and-desktop-notifications", "content": "While vPro can display simple in-system notifications (sometimes called toasters), we realize you don't always have your browser up and focused on our site all day. To help keep users aware of important events, vPro will now ask for permission to push notifications to your browser. This in turn lets your operating system pop up a notification when chosen events occur. The three supported browsers of Chrome, Firefox, and Edge will handle these slightly differently, but all will allow you to know something important happened or requires your attention in vPro. Most users will have no issues simply logging in and accepting the request to push notifications. Once enabled, they just pop up! Should anyone initially deny this permission, you can always re-ask through your user settings and the 'Notifications' tab. If you do not see the orange banner asking for permission, you may need to Allow our site. This will likely be a one-time step. For each browser, these are the quickest ways to Block/Allow permissions on any website. There may be some locations where IT has settings like these more locked-down. You may even need to reach out to your internal IT department should you not have access permissions on your machine or browser. More details on how operating systems and browsers handle these notifications are linked below." },
  { "title": "Stations", "url": "https://vcreativeinc.com/knowledge/hc/en-us/articles/360050536574-stations", "content": "The Stations available for a market/firm in vPro are setup first by vPro staff prior to training and roll-out. From there, new ones can be added but only through vPro staff as additional stations may impact usage agreements and billing. Local Admins can however make changes to stations once they are created. The most popular change is setting the display colors, to better represent the station imaging colors." }
]
